{
  "cache": {
    "0d84657bc54eab084167fc7d97b9e92ef1cd0b0af267d99833d67fa00546b868": {
      "source_text": "Как __ENT_0__ спас планету\n\n__ENT_1__ и __ENT_2__ были неразлучны: одноклассники, друзья и настоящие соратники во всех своих приключениях.\n\nДети жили в городе, где летом всё плавилось от жары и скуки.",
      "translation": "How __ENT_0__ saved the planet\n\n__ENT_1__ and __ENT_2__ were inseparable: classmates, friends and true companions in all their adventures.\n\nThe children lived in a city where everything melted from heat and boredom in summer.",
      "source_lang": "ru",
      "target_lang": "en-US",
      "engine": "DeepLEngine",
      "timestamp": "2025-11-27T14:57:20.370218"
    },
    "26a566cba4e6ebc07abf5e441309080f01def72123cd7eae3d29b429de1dd16a": {
      "source_text": "Учебный год подходил к концу, и они мечтали провести июнь вместе у бабушки Кати в деревне.\n\nИм не терпелось нырнуть в реку, отправиться в поход, открыть тайные лесные тропинки и набить карманы душисты...",
      "translation": "The school year was coming to an end, and they dreamed of spending June together at Grandma Katya's in the village.\n\nThey couldn't wait to dive into the river, go hiking, discover secret forest paths and fill their pockets with fragrant berries. The school year was coming to an end, and they dreamed of spending June together at Grandma Katya's house in the village. They couldn't wait to dive into the river, go hiking, discover secret forest paths and fill their pockets with fragrant berries.\n\nSoon the long-awaited summer came. __ENT_1__ left first, __ENT_0__ was to join in a few days. Everything seemed simple and joyful.",
      "source_lang": "ru",
      "target_lang": "en-US",
      "engine": "DeepLEngine",
      "timestamp": "2025-11-27T14:57:22.965270"
    },
    "4c9a97c1cf3381a37acefaa32669b07842a905efa013cd32bd9b54ac7f7b7e62": {
      "source_text": "Но вскоре пришла неожиданная и печальная весть: бабушки не стало. Их летние планы рассыпались, как песчаный замок под дождём.\n\nПосле похорон __ENT_0__ с мамой остались в её доме — большом, тихом, полн...",
      "translation": "But soon the unexpected and sad news came: Grandma was gone. Their summer plans fell apart like a sandcastle in the rain.\n\nAfter the funeral, __ENT_0__ and her mother stayed in her house - big, quiet, full of the smell of mint, old books and something subtly mysterious. It seemed that the house itself did not want to believe that the mistress was gone.\n\nKatya's mother often sighed, going through her papers:",
      "source_lang": "ru",
      "target_lang": "en-US",
      "engine": "DeepLEngine",
      "timestamp": "2025-11-27T14:57:25.833652"
    },
    "134e7405c20cd193642c029d07d1674afdf79e3a7c8c67a050cc2569ae97112e": {
      "source_text": "— Твоя бабушка была биохимиком. Всё время работала над каким-то проектом… Очень уставала. И однажды просто не вернулась…\n\nАртёму было по-настоящему грустно. Он жалел Катю, жалел это потерянное лето.\n\n...",
      "translation": "- Your grandmother was a biochemist. She was always working on some project. She was very tired. And one day she just didn't come back.\n\nArtyom was really sad. He felt sorry for Katya, sorry for that lost summer.\n\nAnd then, a few days later, he got a call. It was __ENT_0__.",
      "source_lang": "ru",
      "target_lang": "en-US",
      "engine": "DeepLEngine",
      "timestamp": "2025-11-27T14:57:28.617291"
    },
    "462a0af596ba2bc68968b61162414c003bc647de2b24d9effc2bae3772973ce1": {
      "source_text": "— __ENT_0__! Ты же обещал приехать. Мама завтра уезжает в город на несколько дней, а я тут одна, скука смертная! Она сказала, что ты можешь пожить у нас. Приезжай, а?\n\n__ENT_1__ очень обрадовался! Пус...",
      "translation": "- __ENT_0__! You promised you'd come. Mom's going to town tomorrow for a few days, and I'm all alone here, bored to death! She said you could stay with us. Come over, huh?\n\n__ENT_1__ was very happy! His grandmother might be gone, but he would be able to support Katya and spend time with his friend. His parents allowed it. He quickly packed his backpack: T-shirts, shorts, his favorite adventure book, and a flashlight (just in case!). The next day Artem took a bus to the village of Glubinka, where Katya's grandmother lived.\n\nThe road seemed long. Finally, the bus stopped at a familiar turn. __ENT_2__ jumped to the ground, adjusted his backpack and walked along the dusty path to his grandmother's house. The house stood a little apart from the others, as if hiding. It was old, wooden, with carved platbands and freshly painted shutters. It was quiet, only grasshoppers chirped.",
      "source_lang": "ru",
      "target_lang": "en-US",
      "engine": "DeepLEngine",
      "timestamp": "2025-11-27T14:57:34.273568"
    },
    "2f05444c746599ab12637228795ad2b531821daddcf50e88e2622e24606691c9": {
      "source_text": "__ENT_0__ поднялся на крыльцо, постучал. Никто не ответил. Он толкнул дверь – она была не заперта.\n\n– __ENT_2__? Я приехал! – крикнул __ENT_1__, заходя в прихожую.\n\nТишина. В доме было пусто и... жутк...",
      "translation": "__ENT_0__ went up to the porch, knocked. No one answered. He pushed on the door-it was unlocked.\n\n- __ENT_2__? I'm here! - __ENT_1__ shouted, walking into the hallway.\n\nThere was silence. The house was empty and... eerie. Sun bunnies danced on the floor, raising dust.",
      "source_lang": "ru",
      "target_lang": "en-US",
      "engine": "DeepLEngine",
      "timestamp": "2025-11-27T14:57:38.521639"
    },
    "fe1479333a35c3f62c5a5c0a2cf6bf729c2b2427f0940cc7eafa69f847f3fddc": {
      "source_text": "\"Наверное, __ENT_4__ пошла провожать маму или в магазин,\" – решил __ENT_0__. Он поставил рюкзак у стены и огляделся. Всё было знакомо, но пахло иначе — не только книгами, но и чем-то тревожным, аптечн...",
      "translation": "\"Probably __ENT_4__ went to see her mom off or to the store,\" __ENT_0__ decided. He set his backpack against the wall and looked around. Everything was familiar, but it smelled different-not just the books, but something disturbing, apothecary-like, as if the air held a trace of Grandma's last experiment.\n\nTo pass the time, __ENT_1__ walked over to a large table littered with papers and books. He pulled out a notebook. It was dark blue, shabby, with frayed edges and a strange circle with a dot in the corner - as if someone had dripped silver paint on purpose. Inside were notes, and... drawings! But what drawings! They weren't flowers or houses. From the pages, as if alive, looked creatures that __ENT_2__ had never seen in life, or in books, or even in the creepiest cartoons. There was a fluffy animal with three shining eyes and a tail like a feather of a firebird. Next to it was a plant with leaves as transparent as glass, with light pulsing inside. And here was something that looked like a stone with thin legs and a tiny mouth. The drawings were very detailed. Under some of them was an inscription, \"Sample #7. Glows on contact with H₂O,\" \"Observed in the purple grove after midnight. Extremely cautious!\" [1]\n\n__ENT_3__ froze, leafing through page after page. His heart beat a little faster. \"Did Kati's grandmother draw all this? But she was a biochemist, not an artist... Or... were these her scientific observations?\" - he thought, looking at the pictures, which were hard to look away from. Could this be the \"secret project\" that Katya's mom was talking about? The project that was studying... unknown creatures?",
      "source_lang": "ru",
      "target_lang": "en-US",
      "engine": "DeepLEngine",
      "timestamp": "2025-11-27T14:57:40.143819"
    },
    "5451cf82e70f46f70eddd878bf21c37a853b16d3d94dcfa29d33f6af84677d4b": {
      "source_text": "Внезапно наверху громко хлопнула дверь. __ENT_0__ вздрогнул и торопливо захлопнул тетрадь.\n\n– __ENT_1__? Это ты? – снова крикнул он, прислушиваясь.\n\nВместо ответа — звенящая, мёртвая тишина. Солнечные...",
      "translation": "Suddenly the door upstairs slammed loudly. __ENT_0__ flinched and hurriedly slammed the notebook shut.\n\n- __ENT_1__? Is that you?\" he called out again, listening.\n\nInstead of an answer, there was a ringing, dead silence. The sun bunnies on the floor suddenly seemed suspiciously angry. Where is __ENT_2__?",
      "source_lang": "ru",
      "target_lang": "en-US",
      "engine": "DeepLEngine",
      "timestamp": "2025-11-27T14:57:45.575771"
    },
    "361b6ad699237809a81f8a548816f6ad167e213bf80885b7b1251370d222fdbe": {
      "source_text": "__ENT_0__ посмотрел на темный проем лестницы, ведущей на второй этаж. Там, в глубине коридора, ему показалось, что мелькнула тень. Или всё-так… показалось?\n\nОн крепко сжал синюю тетрадь. Лето в деревн...",
      "translation": "__ENT_0__ looked at the dark opening of the staircase leading to the second floor. There, in the depths of the corridor, he thought he saw a shadow flicker. Or was it just a shadow?\n\nHe clutched the blue notebook tightly. Summer in the village of Glubinka was just beginning - and it had already become... mysterious.",
      "source_lang": "ru",
      "target_lang": "en-US",
      "engine": "DeepLEngine",
      "timestamp": "2025-11-27T14:57:47.887978"
    }
  },
  "metadata": {
    "last_updated": "2025-11-27T14:57:47.888523",
    "total_entries": 9
  }
}